# StairSetConfigType

## Description
Sets Stair Configuration Type.

```pascal
FUNCTION StairSetConfigType(
				stair             : HANDLE;
				ConfigurationType : INTEGER) : BOOLEAN;
```

```python

def vs.StairSetConfigType(stair, ConfigurationType):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|stair|HANDLE||
|ConfigurationType|INTEGER||

## Version
Availability: from Vectorworks 2021
## Category
* Objects - Stairs